In [2]:
import pandas as pd
from functools import reduce

In [3]:
t_list =[1,2,3,4]
at = [[1,2,3,4],[6,7,8,9],[10,11,12,13]]
t_df = pd.DataFrame(at,columns = [['A','B','C','D']])

In [4]:
(lambda x : x*2)(2)

4

In [5]:
double = lambda x:x*2
list(map(double,t_list))

[2, 4, 6, 8]

In [11]:
bigger_two =lambda x:x>2
double(2)

4

In [12]:
list(filter(bigger_two,t_list))

[3, 4]

In [6]:
multiply = lambda x,y: x*y
reduce(multiply,t_list)

24

In [7]:
t_df

    A   B   C   D
0   1   2   3   4
1   6   7   8   9
2  10  11  12  13

In [8]:
t_df['A'].apply(double)

    A
0   2
1  12
2  20

In [9]:
t_df.apply(double)

    A   B   C   D
0   2   4   6   8
1  12  14  16  18
2  20  22  24  26

In [10]:
t_df.applymap(double)

    A   B   C   D
0   2   4   6   8
1  12  14  16  18
2  20  22  24  26